Revit 2027 API
AnalysisDisplayVectorSettings.IsEqual Method
 Compares two vector settings objects.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisDisplayVectorSettings other
)
Public Function IsEqual (
	other As AnalysisDisplayVectorSettings
) As Boolean
public:
bool IsEqual(
	AnalysisDisplayVectorSettings^ other
)
member IsEqual :
        other : AnalysisDisplayVectorSettings -> bool
Parameters
other AnalysisDisplayVectorSettings
 Vector settings object to compare with.
Return Value
Boolean
 True if objects are equal, false otherwise.
See Also
Reference
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace